OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18lf4458.h
/*
 * This declarations of the PIC18LF4458 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:24:03 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#ifndef __PIC18LF4458_H__
#define __PIC18LF4458_H__

//==============================================================================

//==============================================================================
//
//	Register Definitions
//
//==============================================================================

extern __at(0x0F62) __sfr SPPDATA;

//==============================================================================
//        SPPCFG Bits

extern __at(0x0F63) __sfr SPPCFG;

typedef union
  {
  struct
    {
    unsigned WS0                : 1;
    unsigned WS1                : 1;
    unsigned WS2                : 1;
    unsigned WS3                : 1;
    unsigned CLK1EN             : 1;
    unsigned CSEN               : 1;
    unsigned CLKCFG0            : 1;
    unsigned CLKCFG1            : 1;
    };

  struct
    {
    unsigned WS                 : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 6;
    unsigned CLKCFG             : 2;
    };
  } __SPPCFGbits_t;

extern __at(0x0F63) volatile __SPPCFGbits_t SPPCFGbits;

#define _WS0                    0x01
#define _WS1                    0x02
#define _WS2                    0x04
#define _WS3                    0x08
#define _CLK1EN                 0x10
#define _CSEN                   0x20
#define _CLKCFG0                0x40
#define _CLKCFG1                0x80

//==============================================================================


//==============================================================================
//        SPPEPS Bits

extern __at(0x0F64) __sfr SPPEPS;

typedef union
  {
  struct
    {
    unsigned ADDR0              : 1;
    unsigned ADDR1              : 1;
    unsigned ADDR2              : 1;
    unsigned ADDR3              : 1;
    unsigned SPPBUSY            : 1;
    unsigned                    : 1;
    unsigned WRSPP              : 1;
    unsigned RDSPP              : 1;
    };

  struct
    {
    unsigned ADDR               : 4;
    unsigned                    : 4;
    };
  } __SPPEPSbits_t;

extern __at(0x0F64) volatile __SPPEPSbits_t SPPEPSbits;

#define _ADDR0                  0x01
#define _ADDR1                  0x02
#define _ADDR2                  0x04
#define _ADDR3                  0x08
#define _SPPBUSY                0x10
#define _WRSPP                  0x40
#define _RDSPP                  0x80

//==============================================================================


//==============================================================================
//        SPPCON Bits

extern __at(0x0F65) __sfr SPPCON;

typedef struct
  {
  unsigned SPPEN                : 1;
  unsigned SPPOWN               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __SPPCONbits_t;

extern __at(0x0F65) volatile __SPPCONbits_t SPPCONbits;

#define _SPPEN                  0x01
#define _SPPOWN                 0x02

//==============================================================================

extern __at(0x0F66) __sfr UFRM;

//==============================================================================
//        UFRML Bits

extern __at(0x0F66) __sfr UFRML;

typedef struct
  {
  unsigned FRM0                 : 1;
  unsigned FRM1                 : 1;
  unsigned FRM2                 : 1;
  unsigned FRM3                 : 1;
  unsigned FRM4                 : 1;
  unsigned FRM5                 : 1;
  unsigned FRM6                 : 1;
  unsigned FRM7                 : 1;
  } __UFRMLbits_t;

extern __at(0x0F66) volatile __UFRMLbits_t UFRMLbits;

#define _FRM0                   0x01
#define _FRM1                   0x02
#define _FRM2                   0x04
#define _FRM3                   0x08
#define _FRM4                   0x10
#define _FRM5                   0x20
#define _FRM6                   0x40
#define _FRM7                   0x80

//==============================================================================


//==============================================================================
//        UFRMH Bits

extern __at(0x0F67) __sfr UFRMH;

typedef struct
  {
  unsigned FRM8                 : 1;
  unsigned FRM9                 : 1;
  unsigned FRM10                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __UFRMHbits_t;

extern __at(0x0F67) volatile __UFRMHbits_t UFRMHbits;

#define _FRM8                   0x01
#define _FRM9                   0x02
#define _FRM10                  0x04

//==============================================================================


//==============================================================================
//        UIR Bits

